app/controllers/authentication_controller.rb

  def createRequest
    @request_params = {
        "description" => params[:description],
        "requestType" => params[:requestType],
        "latitude" => params[:latitude],
        "longitude" => params[:longitude],
        "address" => params[:address],
        "user_id" => @current_user.id,
        "status" => params[:status],
    }

    logger::info @request_params
    @request =  Request.new(@request_params)
    if @request.save
---
INSERT INTO "requests" ("user_id", "description", "requestType", "latitude", "longitude", "address", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def getRequests
    @requests =  Request.all
---
SELECT "requests".* FROM "requests"