app/controllers/main_controller.rb

INSERT INTO "requests" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-07-07 15:28:15.995833"], ["updated_at", "2020-07-07 15:28:15.995833"]]
---
  def createRequest
    @request_params = {
        "description" => params[:description],
        "requestType" => params[:requestType],
        "latitude" => params[:latitude],
        "longitude" => params[:longitude],
        "address" => params[:address],
        "user_id" => params[:userId],
        "status" => params[:status],
    }
    @request =  Request.new(@request_params)
    if @request.save

SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1  [["id", 6]]
UPDATE "requests" SET "status" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["status", true], ["updated_at", "2020-07-19 00:38:34.021065"], ["id", 6]]
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT distinct(user_id) FROM "conversations" WHERE "conversations"."request_id" = $1 AND "conversations"."user_id" != $2  [["request_id", 6], ["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(DISTINCT "conversations"."user_id") FROM "conversations" WHERE "conversations"."request_id" = $1  [["request_id", 17]]
DELETE FROM "conversations" WHERE "conversations"."id" = $1  [["id", 20]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."request_id" = $1 AND "conversations"."user_id" = $2  [["request_id", 1], ["user_id", 7]]
---
  def activeRequest
    Request.where(id: params[:requestId]).update(:status => true)
    @request = Request.find_by_id(params[:requestId])
    @conversations = Conversation.where(request_id: params[:requestId]).where.not(user_id: @request.user_id).select('distinct(user_id)')
    @lastUserId = @conversations[@conversations.length() - 1].user_id
    Conversation.where(request_id: params[:requestId]).where(user_id: @lastUserId).destroy_all

SELECT "requests".* FROM "requests" WHERE "requests"."status" = $1  [["status", true]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "requests" SET "status" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["status", false], ["updated_at", "2020-07-08 09:57:28.402856"], ["id", 17]]
---
  def getRequests
    @tempRequests =  Request.where(status: true).all
    @requests = []
    @tempRequests.each do |request|
      @temp = {
          "id" => request.id,
          "userId" => request.user_id.to_s,
          "description" => request.description,
          "requestType" => request.requestType,
          "latitude" => request.latitude,
          "longitude" => request.longitude,
          "address" => request.address,
          "userName" => request.user.firstName + ' ' + request.user.lastName,
          "status" => request.status,
      }
      @requests.push(@temp)

INSERT INTO "messages" ("user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 6], ["content", "asdfdsafas"], ["created_at", "2020-07-19 00:58:49.956736"], ["updated_at", "2020-07-19 00:58:49.956736"]]
INSERT INTO "conversations" ("request_id", "user_id", "message_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["request_id", 1], ["user_id", 6], ["message_id", 17], ["created_at", "2020-07-19 00:58:49.974210"], ["updated_at", "2020-07-19 00:58:49.974210"]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."request_id" = $1 AND "conversations"."user_id" = $2  [["request_id", 17], ["user_id", 2]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."request_id" = $1 AND "conversations"."user_id" = $2  [["request_id", 1], ["user_id", 6]]
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT distinct(user_id) FROM "conversations" WHERE "conversations"."request_id" = $1 AND "conversations"."user_id" != $2  [["request_id", 17], ["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT distinct(user_id) FROM "conversations" WHERE "conversations"."request_id" = $1 AND "conversations"."user_id" != $2  [["request_id", 1], ["user_id", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1  [["id", 1]]
UPDATE "requests" SET "status" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["status", false], ["updated_at", "2020-07-19 01:00:33.556012"], ["id", 1]]
---
  def createMessage
    @message_params = {
        "user_id" => params[:helperId],
        "content" => params[:content],
    }
    @message = Message.new(@message_params)
    if @message.save
      @conversation_params = {
          "request_id" => params[:requestId],
          "user_id" => params[:conversationUserId],
          'message_id' => @message.id
      }
      @conversation = Conversation.new(@conversation_params);
      if @conversation.save
        @conversations = Conversation.where(request_id: params[:requestId]).where(user_id: params[:conversationUserId]).all
        @messages = []
        @conversations.each do |conversation|
          @temp = {
              "userName" => conversation.message.user.firstName + ' ' + conversation.message.user.lastName,
              "content" => conversation.message.content,
          }
          @messages.push(@temp)
        end
        @request = Request.find_by_id(params[:requestId])
        @conversations = Conversation.where(request_id: params[:requestId]).where.not(user_id: @request.user_id).select('distinct(user_id)')
        if @conversations.length() > 4
          Request.where(id: params[:requestId]).update(:status => false)

SELECT "conversations".* FROM "conversations" WHERE "conversations"."request_id" = $1 AND "conversations"."user_id" = $2  [["request_id", 17], ["user_id", 6]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."request_id" = $1 AND "conversations"."user_id" = $2  [["request_id", 1], ["user_id", 6]]
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def getMessage
    @conversations = Conversation.where(request_id: params[:requestId]).where(user_id: params[:conversationUserId]).all
    @messages = []
    @conversations.each do |conversation|
      @temp = {
          "userName" => conversation.message.user.firstName + ' ' + conversation.message.user.lastName,
          "content" => conversation.message.content,
      }

SELECT distinct(user_id) FROM "conversations" WHERE "conversations"."request_id" = $1 AND "conversations"."user_id" != $2  [["request_id", 1], ["user_id", 2]]
SELECT distinct(user_id) FROM "conversations" WHERE "conversations"."request_id" = $1 AND "conversations"."user_id" != $2  [["request_id", 1], ["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def getHelper
    @conversations = Conversation.where(request_id: params[:requestId]).where.not(user_id: params[:userId]).select('distinct(user_id)')
    @helpers = []
    @conversations.each do |conversation|
      @temp = {
          "userName" => conversation.user.firstName + ' ' + conversation.user.lastName,
          "userId" => conversation.user_id,
      }

SELECT "conversations".* FROM "conversations" WHERE "conversations"."request_id" = $1 AND "conversations"."user_id" = $2  [["request_id", 17], ["user_id", 2]]
SELECT distinct on (request_id) * FROM "conversations" WHERE "conversations"."user_id" != $1  [["user_id", 3]]
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT distinct on (user_id) * FROM "conversations" WHERE "conversations"."request_id" = $1  [["request_id", 1]]
---
  def getRequestUser
    @conversations = Conversation.where(user_id: params[:userId]).select('distinct on (request_id) *')
    @helpers = []
    @conversations.each do |conversation|
      @temp = {
          "userName" => conversation.request.user.firstName + ' ' + conversation.request.user.lastName,
          "userId" => conversation.request.user.id,
          "requestId" => conversation.request.id,
          "myRequest" => false
      }
      @helpers.push(@temp)
    end
    @request = Request.find_by_user_id(params[:userId])
    if @request
      @conversations = Conversation.where(request_id: @request.id).select('distinct on (user_id) *')
      @conversations.each do |conversation|
        @temp = {
            "userName" => conversation.user.firstName + ' ' + conversation.user.lastName,
            "userId" => conversation.user.id,
            "requestId" => conversation.request.id,
            "myRequest" => true

SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = $1 AND "requests"."status" = $2 AND "requests"."updated_at" BETWEEN $3 AND $4  [["user_id", 1], ["status", false], ["updated_at", "2020-07-18 01:07:10.108415"], ["updated_at", "2020-07-19 01:07:10.108439"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def getDeactivatedRequests
    @tempRequests =  Request.where(user_id: params[:userId]).where(status: false).where(updated_at: (Time.now - 24.hours)..Time.now).all
    @requests = []
    @tempRequests.each do |request|
      @temp = {
          "id" => request.id,
          "userId" => request.user_id.to_s,
          "description" => request.description,
          "requestType" => request.requestType,
          "latitude" => request.latitude,
          "longitude" => request.longitude,
          "address" => request.address,
          "userName" => request.user.firstName + ' ' + request.user.lastName,
          "status" => request.status,
      }