app/controllers/main_controller.rb

  def createConversation
    @conversation_params = {
        "request_id" => params[:requestId],
        "user_id" => @current_user.id,
        "message" => params[:message],
    }
    @conversation =  Conversation.new(@conversation_params)
    if @conversation.save
      @tempConversations =  Conversation.where(request_id: params[:requestId]).all
      @conversations = []
      @tempConversations.each do |conversation|
        @temp = {
            "id" => conversation.id,
            "requestId" => conversation.request_id,
            "userId" => conversation.user_id,
            "userName" => conversation.user.firstName + ' ' + conversation.user.lastName,
            "message" => conversation.message,
        }
        @conversations.push(@temp)
      end
      @userCount = Conversation.where(request_id: params[:requestId]).distinct.count(:user_id)
      if @userCount > 4
        Request.where(id: params[:requestId]).update(:status => false)
---
INSERT INTO "conversations" ("request_id", "user_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["request_id", 2], ["user_id", 1], ["message", "I love you"], ["created_at", "2020-07-07 15:30:58.263548"], ["updated_at", "2020-07-07 15:30:58.263548"]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."request_id" = $1  [["request_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."request_id" = $1 AND "conversations"."user_id" = $2  [["request_id", 17], ["user_id", 2]]
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "conversations" ("request_id", "user_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["request_id", 17], ["user_id", 3], ["message", "asdfsafdsadf"], ["created_at", "2020-07-08 09:46:04.349905"], ["updated_at", "2020-07-08 09:46:04.349905"]]
SELECT COUNT(DISTINCT "conversations"."user_id") FROM "conversations" WHERE "conversations"."request_id" = $1  [["request_id", 17]]
UPDATE "requests" SET "status" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["status", false], ["updated_at", "2020-07-08 09:57:28.402856"], ["id", 17]]
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1  [["id", 17]]

  def getConversation
    @tempConversations =  Conversation.where(request_id: params[:requestId]).all
    @conversations = []
    @tempConversations.each do |conversation|
      @temp = {
          "id" => conversation.id,
          "requestId" => conversation.request_id,
          "userId" => conversation.user_id,
          "userName" => conversation.user.firstName + ' ' + conversation.user.lastName,
          "message" => conversation.message,
      }
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."request_id" = $1  [["request_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]