app/controllers/users_controller.rb

INSERT INTO "users" ("firstName", "lastName", "email", "password_digest", "attachment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save